<template lang="pug">
    .advantages
        .green-block.green-block_first
            img(src="/img/greenBlock.png")
        .green-block.green-block_second
            img(src="/img/greenBlock.png")
        h3.title.z-index2 Качество и надежность — наши преимущества
        p.sub-title.sub-title_bottom Равным образом новая модель организационной деятельности требуют определения и уточнения существенных финансовых и административных условий. Задача организации, в особенности же начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке дальнейших направлений развития. 
        p.sub-title Таким образом постоянный количественный рост и сфера нашей активности обеспечивает широкому кругу (специалистов) участие в формировании позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности играет важную роль в формировании систем массового участия. Товарищи!  постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет оценить значение соответствующий условий активизации. Не следует, однако забывать, что реализация намеченных плановых заданий обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации.
</template>

<script>
    export default {
        
    }
</script>

<style lang="scss" >
    .advantages{
        margin: 95px auto 0;
        display: flex;
        justify-content: center;
        flex-direction: column;
        max-width: 822px;
        position: relative;

        @media screen and (max-width: 1200px){
            width: 605px;
        }

        @media screen and (max-width: 600px){
            width: 100%;
        }
    }
</style>