<template lang="pug">
    .wiki-text
        h3.title Фундамент
        p.sub-title Фундамент для частного дома необходимо тщательно просчитать и выполнять в соответствии с технологическими требованиями. В основном используется ленточный фундамент или плиточный. Но для регионов с низким уровнем грунтовых вод рекомендуется возведение свайного фундамента. Работы по заливке фундамента необходимо заказывать в профессиональных строительных компаниях. В таком случае вы обеспечите долговечность
        ul.wiki-text-items
            li.wiki-text-item Бетон должен быть марки не ниже, чем М-250 (Б20);
            li.wiki-text-item Фундамент должен соответствовать проекту КЖ (конструкции железобетонные);
            li.wiki-text-item На углах арматурный каркас должен быть загнут;
            li.wiki-text-item Весь объем бетона должен быть залит за один раз;
            li.wiki-text-item Для равномерной заливки бетона и предотвращения образования трещин должна использоваться виброусадка;
            li.wiki-text-item Перепад высоты на всем фундаменте должен быть не более 50 миллиметров;
            li.wiki-text-item  Перед заливкой бетона арматурный каркас должен быть сдан заказчику; Не допускается забрасывание в траншею песка и земли перед заливкой.
        p.sub-title.sub-title_bottom Ленточный фундамент — выполняется в виде замкнутого контура под зданием. Геометрия фундамента должна совпадать с планом конструкции здания. Укладывают ленточный фундамент на песчано-гравийную подушку. Первым этапом роют канавы, в которые укладывается опалубка для будущего фундамента. Перед тем, как залить железобетон, укладывается арматура, обеспечивающая прочность, устойчивость конструкции здания. Возведение стен здания возможно только после высыхания и усадки фундамента. Обычно к строительству дома приступают через год.
        p.sub-title.sub-title_bottom Свайный-ростверковый фундамент имеет преимущество в сроках возведения здания. Для того чтобы приступить к строительству коробки дома достаточно выдержать нормативный период высыхания залитого раствора. Строительство здания можно вести в любой период года. Преимущества в районах с неровным рельефом местности, в сложных гидрогеологических условиях. Опалубкой для свай служат асбестоцементные трубы диаметром 300 мм.
        p.sub-title.sub-title_bottom Плитный фундамент изготавливают из железобетона. Они устойчивы, выдерживают большой вес конструкции. Рекомендованы в районах спокойного рельефа местности.

</template>

<script>
    export default {
        
    }
</script>

<style lang="scss">
    .wiki-text{
        margin-left: 70px;
        max-width: 747px;

        @media screen and (max-width: 1200px){
            margin-left: 0;
        }

        @media screen and (max-width: 600px){
            margin-bottom: 80px;
        }
        
        .title{
            margin-top: 15px;
            margin-bottom: 20px;
        }
    }

    .wiki-text{
        &-items{
            font-weight: 300;
            font-size: 16px;
            line-height: 26px;
            color: #292929;
            margin-bottom: 25px;
            margin-left: 0;
            padding-left: 20px;

            @media screen and (max-width: 1200px){
                padding-left: 19px;
            }
        }
        &-item{
            padding-bottom: 20px;

            &:last-child{
                padding-bottom: 0px;
            }
        }
    }
</style>